---
kind: method
id: M:Autodesk.Revit.DB.BoundingBoxXYZ.#ctor
zh: 包围盒
source: html/8bbaa502-3614-b251-5b14-95b37a65fada.htm
---
# Autodesk.Revit.DB.BoundingBoxXYZ.#ctor Method

**中文**: 包围盒

Constructs a new BoundingBoxXYZ with a default transform and extents of (-100, -100, -100) to (100, 100, 100).

## Syntax (C#)
```csharp
public BoundingBoxXYZ()
```